/* errAuthorizationInvalidSet */
"-60001" = "Godkendelsesrettighederne er ugyldige.";

/* errAuthorizationInvalidRef */
"-60002" = "Godkendelsesreferencen er ugyldig.";

/* errAuthorizationInvalidTag */
"-60003" = "Godkendelseskoden er ugyldig.";

/* errAuthorizationInvalidPointer */
"-60004" = "Den returnerede godkendelse er ugyldig.";

/* errAuthorizationDenied */
"-60005" = "Godkendelsen blev nægtet.";

/* errAuthorizationCanceled */
"-60006" = "Godkendelsen blev annulleret af brugeren.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Godkendelsen blev nægtet, fordi der ikke var mulighed for brugerindgriben.";

/* errAuthorizationInternal */
"-60008" = "Kan ikke opnå godkendelse til denne handling.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Godkendelsen må ikke konverteres til et eksternt format.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Godkendelsen må ikke oprettes fra et eksternt format.";

/* errAuthorizationInvalidFlags */
"-60011" = "Det eller de leverede mulighedsflag er ugyldige til denne godkendelseshandling.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Det anførte program kan ikke afvikles.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Der blev returneret en ugyldig status under afvikling af et priviligeret værktøj.";

/* errAuthorizationBadAddress */
"-60033" = "Den ønskede socketadresse er ugyldig (skal være 0-1023 inkl.).";

/* errSSLProtocol */
"-9800" = "Fejl ved SSL-protokol";

/* errSSLNegotiation */
"-9801" = "Cipher Suite-kommunikation mislykkedes";

/* errSSLFatalAlert */
"-9802" = "Alvorlig advarsel";

/* errSSLWouldBlock */
"-9803" = "I/O vil blokere (ikke alvorligt)";

/* errSSLSessionNotFound */
"-9804" = "forsøg på gendannelse af ukendt session";

/* errSSLClosedGraceful */
"-9805" = "forbindelsen blev afbrudt korrekt";

/* errSSLClosedAbort */
"-9806" = "forbindelsen afbrudt pga. fejl";

/* errSSLXCertChainInvalid */
"-9807" = "ugyldig certifikatkæde";

/* errSSLBadCert */
"-9808" = "forkert format til certifikat";

/* errSSLCrypto */
"-9809" = "underliggende krypteringsfejl";

/* errSSLInternal */
"-9810" = "intern fejl";

/* errSSLModuleAttach */
"-9811" = "fejl ved tilslutning af modul";

/* errSSLUnknownRootCert */
"-9812" = "gyldig certifikatskæde, ikke godkendt rod";

/* errSSLNoRootCert */
"-9813" = "certifikatskæde ikke godkendt af rod";

/* errSSLCertExpired */
"-9814" = "kæden havde et udløbet certifikat";

/* errSSLCertNotYetValid */
"-9815" = "kæden havde et certifikat, som endnu ikke er gyldigt";

/* errSSLClosedNoNotify */
"-9816" = "serveren afbrød forbindelsen uden advarsel";

/* errSSLBufferOverflow */
"-9817" = "utilstrækkelig buffer";

/* errSSLBadCipherSuite */
"-9818" = "forkert SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "uventet besked modtaget";

/* errSSLPeerBadRecordMac */
"-9820" = "forkert MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "afkryptering mislykkedes";

/* errSSLPeerRecordOverflow */
"-9822" = "overløb af poster";

/* errSSLPeerDecompressFail */
"-9823" = "fejl under dekomprimering";

/* errSSLPeerHandshakeFail */
"-9824" = "handshake mislykkedes";

/* errSSLPeerBadCert */
"-9825" = "forkert certifikat (div.)";

/* errSSLPeerUnsupportedCert */
"-9826" = "forkert certifikatformat";

/* errSSLPeerCertRevoked */
"-9827" = "certifikat tilbagekaldt";

/* errSSLPeerCertExpired */
"-9828" = "certifikat udløbet";

/* errSSLPeerCertUnknown */
"-9829" = "ukendt certifikat";

/* errSSLIllegalParam */
"-9830" = "ulovlig parameter";

/* errSSLPeerUnknownCA */
"-9831" = "ukendt certifikatmyndighed";

/* errSSLPeerAccessDenied */
"-9832" = "adgang nægtet";

/* errSSLPeerDecodeError */
"-9833" = "afkodningsfejl";

/* errSSLPeerDecryptError */
"-9834" = "fejl under afkryptering";

/* errSSLPeerExportRestriction */
"-9835" = "eksportbegrænsning";

/* errSSLPeerProtocolVersion */
"-9836" = "forkert protokolversion";

/* errSSLPeerInsufficientSecurity */
"-9837" = "utilstrækkelig sikkerhed";

/* errSSLPeerInternalError */
"-9838" = "intern fejl";

/* errSSLPeerUserCancelled */
"-9839" = "bruger annullerede";

/* errSSLPeerNoRenegotiation */
"-9840" = "genforhandling ikke tilladt";

/* errSSLServerAuthCompleted */
"-9841" = "servercertifikat er gyldigt eller blev ignoreret, hvis kontrol er slået fra";

/* errSSLClientCertRequested */
"-9842" = "server har anmodet om et klientcertifikat";

/* errSSLHostNameMismatch */
"-9843" = "fejl i værtsnavn";

/* errSSLConnectionRefused */
"-9844" = "den anden part afbrød forbindelsen uden at svare";

/* errSSLDecryptionFail */
"-9845" = "afkrypering mislykkedes";

/* errSSLBadRecordMac */
"-9846" = "forkert MAC";

/* errSSLRecordOverflow */
"-9847" = "overløb af poster";

/* errSSLBadConfiguration */
"-9848" = "konfigurationsfejl";

/* errSecSuccess */
"0" = "Ingen fejl.";

/* errSecUnimplemented */
"-4" = "Funktion eller handling ikke implementeret";

/* errSecParam */
"-50" = "En eller flere parametre videreført til en funktion var ikke gyldige.";

/* errSecAllocate */
"-108" = "Kunne ikke tildele hukommelse.";

/* errSecNotAvailable */
"-25291" = "Ingen nøglering tilgængelig. Du skal måske starte computeren igen.";

/* errSecReadOnly */
"-25292" = "Denne nøglering kan ikke ændres.";

/* errSecAuthFailed */
"-25293" = "Det brugernavn eller den adgangskode, du har skrevet, er forkert.";

/* errSecNoSuchKeychain */
"-25294" = "Den anførte nøglering findes ikke.";

/* errSecInvalidKeychain */
"-25295" = "Den anførte nøglering er ikke et gyldigt nøgleringsarkiv.";

/* errSecDuplicateKeychain */
"-25296" = "Der findes allerede en nøglering med samme navn.";

/* errSecDuplicateCallback */
"-25297" = "Den anførte tilbagekaldsfunktion er allerede installeret.";

/* errSecInvalidCallback */
"-25298" = "Den anførte tilbagekaldsfunktion er ugyldig.";

/* errSecDuplicateItem */
"-25299" = "Det anførte emne findes allerede i nøgleringen.";

/* errSecItemNotFound */
"-25300" = "Den anførte emne blev ikke fundet i nøgleringen.";

/* errSecBufferTooSmall */
"-25301" = "Der er ikke hukommelse nok til at bruge det anførte emne.";

/* errSecDataTooLarge */
"-25302" = "Det anførte emne indeholder oplysninger, der fylder for meget eller har et format, som ikke kan vises.";

/* errSecNoSuchAttr */
"-25303" = "Den anførte egenskab eksisterer ikke.";

/* errSecInvalidItemRef */
"-25304" = "Det anførte emne er ikke længere gyldigt. Det er måske blevet fjernet fra nøgleringen.";

/* errSecInvalidSearchRef */
"-25305" = "Kan ikke søge i den aktuelle nøglering.";

/* errSecNoSuchClass */
"-25306" = "Det anførte emne er tilsyneladende ikke et gyldigt nøgleringsemne.";

/* errSecNoDefaultKeychain */
"-25307" = "Der blev ikke fundet en standardnøglering.";

/* errSecInteractionNotAllowed */
"-25308" = "Brugerindgriben er ikke tilladt.";

/* errSecReadOnlyAttr */
"-25309" = "Den anførte egenskab kan ikke ændres.";

/* errSecWrongSecVersion */
"-25310" = "Denne nøglering blev oprettet med en anden version af System-software og kan ikke åbnes.";

/* errSecKeySizeNotAllowed */
"-25311" = "Dette emne bruger en nøgle, som er for stor.";

/* errSecNoStorageModule */
"-25312" = "En nødvendig komponent (modul til lagring af data) kunne ikke indlæses. Du skal måske starte computeren igen.";

/* errSecNoCertificateModule */
"-25313" = "En nødvendig komponent (certifikatmodul) kunne ikke indlæses. Du skal måske starte computeren igen.";

/* errSecNoPolicyModule */
"-25314" = "En nødvendig komponent (politikmodul) kunne ikke indlæses. Du skal måske starte computeren igen.";

/* errSecInteractionRequired */
"-25315" = "Brugerindgriben kræves, men er ikke tilladt i øjeblikket.";

/* errSecDataNotAvailable */
"-25316" = "Indholdet af dette emne kan ikke hentes.";

/* errSecDataNotModifiable */
"-25317" = "Indholdet af dette emne kan ikke ændres.";

/* errSecCreateChainFailed */
"-25318" = "Et eller flere nødvendige certifikater til kontrol af dette certifikat blev ikke fundet.";

/* errSecInvalidPrefsDomain */
"-25319" = "Det anførte indstillings-domæne er ugyldigt.";

/* errSecACLNotSimple */
"-25240" = "Den valgte liste til adgangskontrol er ikke i standardformat (enkelt format).";

/* errSecPolicyNotFound */
"-25241" = "Den anførte regel findes ikke.";

/* errSecInvalidTrustSetting */
"-25242" = "Den anførte godkendelsesindstilling er ugyldig.";

/* errSecNoAccessForItem */
"-25243" = "Det anførte emne har ingen adgangskontrol.";

/* errSecInvalidOwnerEdit */
"-25244" = "Ugyldigt forsøg på at skifte ejer til dette emne.";

/* errSecTrustNotAvailable */
"-25245" = "Ingen tilgængelige godkendelsesresultater.";

/* errSecUnsupportedFormat */
"-25256" = "Import-/eksportformat understøttes ikke.";

/* errSecUnknownFormat */
"-25257" = "Ukendt format ved import.";

/* errSecKeyIsSensitive */
"-25258" = "Vigtigt materiale skal pakkes ved eksport.";

/* errSecMultiplePrivKeys */
"-25259" = "Forsøg på at importere flere private nøgler.";

/* errSecPassphraseRequired */
"-25260" = "Adgangskoden kræves til import/eksport.";

/* errSecInvalidPasswordRef */
"-25261" = "Referencen til adgangskoden var ugyldig.";

/* errSecInvalidTrustSettings */
"-25262" = "Posten med godkendelsesindstillinger var ødelagt.";

/* errSecNoTrustSettings */
"-25263" = "Ingen godkendelsesindstillinger fundet.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC-godkendelse mislykkedes under import af PKCS12.";

/* errSecDecode */
"-26275" = "Kan ikke afkode de leverede data.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Fejlværdier i CSP-vektorbuffere.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Kontekstfejlværdier i CSP-kryptografi.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Fejlværdier i CSP kryptografisk API.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Der blev gjort et forsøg på at bruge en offentlig nøgle, som ikke er komplet på grund af * manglende algoritmebaserede parametre.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "en kodesignatur ikke passede";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Nøglen StartDate/EndDate ugyldig";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Fejlkoder i synkronisering af nøglering";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2-paddingkontrol: Vedvarende angreb registreret";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "Argumentet OpenParameters videreført til CSSM_DL_DbCreate eller CSSM_DL_DbOpen var hverken NULL eller en markør til en gyldig CSSM_APPLEDL_OPEN_PARAMETERS-struktur.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = " en handling mislykkedes, fordi disken var fuld";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "en handling mislykkedes, fordi en diskkvote blev overskredet";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "en handling mislykkedes, fordi et arkiv var for stort";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "de interne oplysninger i en nøglerings database (\"blob\") er ugyldige";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "versionen på det interne dataformat på en databases interne oplysninger (\"blob\") er ugyldig";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Værtsnavne stemmer ikke overens";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Ikke forstået udvidelse med kritisk flag true";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Grundlæggende begrænsningsudvidelse kræves pr. politik, men findes ikke";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Ugyldige BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Ugyldig nøgle-id til myndighed ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Ugyldig id til emnenøgle ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Ugyldig nøglebrug til politik";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Ugyldig udvidet nøglebrug til politik";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Ugyldig sammenkædning af id til emne-/myndighedsnøgle";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint overskredet";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Certifikatgruppe ophørt på et rodcertifikat, som ikke verificerede sig selv";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL udløbet/ikke gyldigt endnu";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Kan ikke finde passende CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Den anførte CRL-server er nede";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "ulæselig URL til CRL-fordelingspunkt";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Ukendt kritisk certifikat-/CRL-endelse";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL kan ikke godkendes som anker eller rod";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL godkendt som rod uden godkendelse";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL kunne ikke godkendes mht. politik";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Krænkelse af udvidelse til udstedende distributionspunkt";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Certifikat ikke fundet hos den anførte issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Forkert certifikat modtaget fra den anførte issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Uoverensstemmende S/MIME e-postadresse";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Relevant udvidet brug af nøgle til S/MIME blev ikke fundet ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Ikke kompatibel brug af S/MIME-nøgle";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certifikat med nøglebrug mærket !kritisk";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, blad med tomt emnenavn og ingen e-postadresse * i SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, blad med tomt emnenavn, SubjectAltName * ikke kritisk";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Relevant udvidet nøglebrug til SSL findes ikke";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "OCSP-svar kan ikke analyseres";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "OCSP-anmodning kan ikke analyseres";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP-tjeneste utilgængelig";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP-status: Certifikat ukendt";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "tilbagekaldelseskontrol lykkedes ikke for alle certifikater";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "generel netværksfejl";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP-svar kan ikke verificeres til anker eller rod";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP-svar verificeret til ikke godkendt rod";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Signaturfejl i OCSP-svar";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Ingen signering af OCSP-svar fundet";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP-svarstatus: Forkert anmodning";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP-svarstatus: Intern fejl";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP-svarstatus: Prøv senere";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP-svarstatus: Signatur kræves";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP-svarstatus: Ikke godkendt";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP-svar passede ikke til anmodning";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "ulovlig certifikatkædelængde til kodesignatur";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Manglende grundlæggende begrænsninger til kodesignatur";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Ugyldig PathLengthConstraint til kodesignatur";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Manglende udvidet nøglebrug til kodesignatur";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Kodesignaturcertifikat af udviklingstypen fundet";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "ulovlig certifikatkædelængde til signering af ressource";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "ugyldig udvidet nøglebrug til signering af ressource";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Godkendelsesindstilling: Afvis";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "ugyldigt tomt emnenavn";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ukendt kritisk id på godkendt certifikatudtalelse";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "anmodning om certifikat anbragt i kø";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "anmodning om certifikat videresendt";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "generel fejl rapporteret af server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "parameterfejl rapporteret af server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "godkendelsesfejl rapporteret af server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "serverrapport ikke implementeret";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "serverrapport ikke tilgængelig";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "serverrapport findes allerede";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "servicefejl rapporteret af server";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "anmodning venter allerede for den angivne bruger";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "ingen ventende anmodning for den angivne bruger";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR kunne ikke kontrollere";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "server rapporterede om mislykket konsistenskontrol";

/* errSecCSUnimplemented */
"-67072" = "ikke implementeret funktion i kodesignering";

/* errSecCSInvalidObjectRef */
"-67071" = "ugyldig API-objektreference";

/* errSecCSInvalidFlags */
"-67070" = "ugyldigt eller upassende API-flag";

/* errSecCSObjectRequired */
"-67069" = "et nødvendigt markørargument var NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "kan ikke finde kodeobjekt på disk";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "kan ikke finde gæster med dette attributsæt";

/* errSecCSInvalidAttributeValues */
"-67066" = "anførte attributværdier er ugyldige";

/* errSecCSNoSuchCode */
"-67065" = "vært har ingen gæst med de nødvendige egenskaber";

/* errSecCSMultipleGuests */
"-67064" = "vært har flere gæster med denne attributværdi";

/* errSecCSGuestInvalid */
"-67063" = "kodeidentitet er gjort ugyldig";

/* errSecCSUnsigned */
"-67062" = "kodeobjekt er ikke signeret";

/* errSecCSSignatureFailed */
"-67061" = "kode eller signatur ændret";

/* errSecCSSignatureNotVerifiable */
"-67060" = "signatur kan ikke læses, f.eks. pga. et arkivsystem, der overfører root til en bruger uden rettigheder";

/* errSecCSSignatureUnsupported */
"-67059" = "ikke understøttet type eller version af signatur";

/* errSecCSBadDictionaryFormat */
"-67058" = "et nødvendigt plist-arkiv eller en nødvendig ressource er ødelagt";

/* errSecCSResourcesNotSealed */
"-67057" = "ressourcer er ikke forseglet af signatur";

/* errSecCSResourcesNotFound */
"-67056" = "kan ikke finde forseglet ressource i kode";

/* errSecCSResourcesInvalid */
"-67055" = "det forseglede ressourcebibliotek er ugyldigt";

/* errSecCSBadResource */
"-67054" = "en forseglet ressource mangler eller er ugyldig";

/* errSecCSResourceRulesInvalid */
"-67053" = "ugyldig/ugyldige regel/regler til ressourcevalg";

/* errSecCSReqInvalid */
"-67052" = "ugyldigt eller ødelagt kodekrav";

/* errSecCSReqUnsupported */
"-67051" = "ikke understøttet type eller version af kodekrav";

/* errSecCSReqFailed */
"-67050" = "kunne ikke leve op til kodekrav";

/* errSecCSBadObjectFormat */
"-67049" = "objektets arkivformat er ugyldigt eller upassende";

/* errSecCSInternalError */
"-67048" = "intern fejl i subsystemet til kodesignatur";

/* errSecCSHostReject */
"-67047" = "kode afviste sin vært";

/* errSecCSNotAHost */
"-67046" = "denne kode er ikke en vært";

/* errSecCSSignatureInvalid */
"-67045" = "ugyldigt format til signatur";

/* errSecCSHostProtocolRelativePath */
"-67044" = "overtrædelse af værtsprotokol - absolut sti til gæst krævet";

/* errSecCSHostProtocolContradiction */
"-67043" = "overtrædelse af værtsprotokol - modsigende værtsfunktioner";

/* errSecCSHostProtocolDedicationError */
"-67042" = "overtrædelse af værtsprotokol - handling ikke tilladt med/til en dedikeret gæst";

/* errSecCSHostProtocolNotProxy */
"-67041" = "overtrædelse af værtsprotokol  - proxyvært ikke reserveret";

/* errSecCSHostProtocolStateError */
"-67040" = "overtrædelse af værtsprotokol - ugyldig anmodning om ændring af gæsts status";

/* errSecCSHostProtocolUnrelated */
"-67039" = "overtrædelse af værtsprotokol - den givne gæst er ikke en gæst hos den givne vært";

/* errSecCSInvalidOperation */
"-67038" = "ønsket handling er ugyldig";

/* errSecCSNotSupported */
"-67037" = "handling understøttes ikke til denne type kode";

/* errSecCSCMSTooLarge */
"-67036" = "signatur for stor til at blive integreret";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "overtrædelse af værtsprotokol - ugyldig gæste-hash";

/* errSecCSStaticCodeChanged */
"-67034" = "programmet på disk svarer ikke til det, der afvikles";

/* errSecCSSigDBDenied */
"-67033" = "adgang til signaturdatabase nægtet";

/* errSecCSSigDBAccess */
"-67032" = "kan ikke få adgang til signaturdatabase";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "vært returnerede ugyldige eller uensartede gæsteattributter";

/* errSecMisc_dskFulErr */
"-34" = "Disken er fuld.";

/* errSecMisc_nsvErr */
"-35" = "Disken blev ikke fundet. Måske er den skubbet ud.";

/* errSecMisc_bdNamErr */
"-37" = "Forsøgte at åbne et arkiv, hvis navn indeholder et ugyldigt tegn.";

/* errSecMisc_fnfErr */
"-43" = "Arkivet blev ikke fundet.";

/* errSecMisc_wPrErr */
"-44" = "Disken er skrivebeskyttet.";

/* errSecMisc_fLckdErr */
"-45" = "Arkivet er låst.";

/* errSecMisc_vLckdErr */
"-46" = "Enheden er låst.";

/* errSecMisc_fBsyErr */
"-47" = "Arkivet er optaget. Måske bruges det af et andet program.";

/* errSecMisc_dupFNErr */
"-48" = "Der findes allerede et arkiv med samme navn.";

/* errSecMisc_opWrErr */
"-49" = "Arkivet er allerede åbnet med skriveadgang";

/* errSecMisc_volOffLinErr */
"-53" = "Enheden er ikke længere tilgængelig. Måske er den skubbet ud.";

/* errSecMisc_permErr */
"-54" = "Arkivet kunne ikke åbnes. Måske bruges det af et andet program.";

/* errSecMisc_extFSErr */
"-58" = "Denne enhed er tilsyneladende ikke kompatibel.";

/* errSecMisc_wrPermErr */
"-61" = "Kunne ikke skrive til arkivet. Det er måske blevet åbnet med utilstrækkelige tilladelser.";

/* errSecMisc_offLinErr */
"-65" = "Lagringsenheden er ikke længere tilgængelig. Måske er den skubbet ud.";

/* errSecMisc_dirNFErr */
"-120" = "Biblioteket blev ikke fundet.";

/* errSecMisc_volGoneErr */
"-124" = "Serverenheden er ikke længere tilgængelig. Måske er forbindelsen blevet afbrudt.";

/* errSecMisc_userCanceledErr */
"-128" = "Handlingen blev annulleret af brugeren.";

/* errSecMisc_resNotFound */
"-192" = "En nødvendig ressource blev ikke fundet.";

/* errSecMisc_resFNotFound */
"-193" = "En nødvendig ressource mangler eller er beskadiget.";

/* errSecMisc_icNoURLErr */
"-673" = "Det anførte sted (URL) er en ukendt type eller indeholder ikke nok oplysninger.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Der blev ikke fundet et hjælpeprogram til åbning af den anførte URL.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "URL-adressen til dette emne mangler eller er formateret forkert.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Ingen adgang til dette emne.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Godkendelse mislykkedes. Adgangskoden til denne server kan være ændret, siden emnet blev føjet til nøgleringen.";

